 - [x] Написать программу которая проверяет является ли квадрат магическим
 ```cpp
 #include <iostream>
int main(){
    int a [3][3] =  {{2, 9, 4},
                     {7, 5, 3},
                     {6, 1, 8}};
    int sum = a[0][0] + a[0][1] + a[0][2];
    if ((a[0][0] + a[1][1] + a[2][2]) == sum){
        if ((a[0][2] + a[1][1] + a[2][0]) == sum){
            if ((a[0][0] + a[0][1] + a[0][2]) == sum){
                if ((a[1][0] + a[1][1] + a[1][2]) == sum){
                    if ((a[2][0] + a[2][1] + a[2][2]) == sum){
                        if ((a[0][0] + a[1][0] + a[2][0]) == sum){
                            if ((a[1][0] + a[1][1] + a[1][2]) == sum){
                                if ((a[2][0] + a[2][1] + a[2][2]) == sum){
                                    std::cout<<"Это магический квадрат";}}}}}}}}
    else{std::cout<<"Это не магический квадрат";}}

```

---

- [x] Натуральное число в P-ичной системе счисление задано своими числами хранящимися в массиве K. Проверить корректность такого представления и перевести число в Q-ичную систему. P и Q - меньше 10.
```cpp
#include <iostream>
#include <cmath>
#include <algorithm>
#include <vector>
#include <stdexcept>
using namespace std;

bool Chec(int K[], int P, int n) {
    for (int i = 0; i < n; i++) {
        if (K[i] >= P) {
            return false;
        }
    }
    return true;
}

int tenSS(int K[], int P, int n) {
    int sum = 0;
    for (int i = 0, j = n - 1; i < n; i++, j--) {
        sum += (pow(P, j) * K[i]);
    }
    return sum;
}

string toQ(int S, int Q) {
    if (Q < 2 || Q > 9) {
        throw invalid_argument("Только от 2 до 9");
    }

    string result;
    while (S > 0) {
        int num = S % Q;
        result += to_string(num);
        S /= Q;
    }

    reverse(result.begin(), result.end());
    return result;
}

int main() {
    int P, Q;
    string K;
    
    cout << "Введите из какой системы будем конвертировать" << endl;
    cin >> P;
    cout << "Введите ваше число" << endl;
    cin >> K;
    cout << "Введите в какую систему будем переводить" << endl;
    cin >> Q;

    int n = K.size();
    int arr[n];

    for (size_t i = 0; i < n; ++i) {
        arr[i] = K[i] - '0';
    }

    if (Chec(arr, P, n)) {
        int sum = tenSS(arr, P, n);
        try {
            string result = toQ(sum, Q);
            cout << result << endl;
        } catch (const invalid_argument& e) {
            cerr << e.what() << endl;
        }
    } else {
        cout << "Недопустимое число для указанной системы счисления" << endl;
    }

    return 0;
}

```

Исходные данные - P - система счисления в котором представлено исходное число. K - строка с числами. Q - система счисления в которую нужно перенести число. Результат - R - число в Q системе счисления.

Мат. модель:
1. Ввод исходных данных. 
2. Проверка число на соответствие системе счисления.
3. Перевод в другую систему счисления. (P - 10 - Q)
4. Вывод данных.

--- 

- [ ] "Тренажёр по арифметике". Пользователь учитель вводит разрядность операндов, тип операции (+ , - , * ,  / ) и количество примеров. Компьютер генерирует случайным образом операнды и выводит пользователю (ученику) серию примеров.В каждом из которых один из операндов или результат замаскирован. Ученик вводит пропущенное число, компьютер проверяет правильность и ведёт статиcтику ошибок.

```cpp

```

Разрядность операндов - сколько цифр в числе

Учитель вводит разрядность, операцию и количество примеров.
Комп генерирует примеры, а после ответов ученика он вывеет статистику ошибок в %.

Исходные данные:
Разрядность операндов - R, int
Операция - O, char
Количество операций - K, int
Ввод результата чеником - Res, int
O1, O2, O3 - Массивы первых, вторых аперандов и результатов  

Результат:
Eror - подсчёт ошибок (int)

Методы:
1. Метод ввода
2. Метод генерации
3. Составление примеров
4. Првоерка результатов

Метод ввода - void input(int &R, char &O, int &K) Ввод чисел
Метод генерации - 
generate(int O1[], int O2[], int O3[], int K, int R, char O){
for (i=0, i<K, i++){
Заполнить числами с определённой рарядностью
O1[i] = rand()%...
O2[i] = rand()%...
}
if +-* / - заполняем O3
}


Создать класс книги в классе предусмотреть: поля, три конструктора, метод  show который выводит данные. Создать 4 экземпляра класса, выполнит поиск книги по автору. 

## 23.10.2024
Написать функцию дохода которая вычисляет доход по вкладу.
Исходные данные: 
- Величина вклада (sum - double)
- Процентная ставка (proc - double)
- Срок вклада (srok - int)

  Для трёх вкладчиков вычислить доход по вкладу.

  Предварительный код:
  
```cpp
dohod = sum * (1 + proc/12/30/100 * srok)

void dohod(double sum, double proc, double srok){
double d = sum * (1 + proc/12/30/100 * srok)
cout<<"Доход = "<<d<<endl;
}

// Однопоточно
main(){
dohod(2000, 21, 30);
dohod(1000, 15, 41);
dohod(10000,12,100);
}

// Чтобы подключить мноопоточность:
#include <threads>
main{
thread t1(dohod, 2000, 21, 30);
thread t2(dohod, 1000, 15,41);
thread t3(dohod, 10000, 12, 100);

t1.join();
t2.join();
t3.join();
}
```


Написать функцию, которая выводит строку состоящую из одинаковых символов. 

Параметрами функции являются длина строки и символ, которые будут повторяться